server/src/test/load-test.yml
config:
  target: "http://localhost:2000"
  processor: "./artillery-hooks.js"
  phases:
    - duration: 60
      arrivalRate: 20
    - duration: 60
      arrivalRate: 50
  defaults:
    headers:
      Content-Type: "application/json"
  plugins:
    metrics-by-endpoint:
      enabled: true
      groupBy: ["url", "method", "statusCode"]
scenarios:
  - name: "User Registration and Login"
    flow:
      - post:
          url: "/v1/users/register"
          json:
            username: "user{{ $randomNumber(1, 10000000) }}"
            email: "user{{ $randomNumber(1, 10000000) }}@example.com"
            password: "password123"
            confirmPassword: "password123"
          afterResponse: "logResponse"
          capture:
            - json: "id"
              as: "userId"
  #     - post:
  #         url: "/v1/users/login"
  #         json:
  #           value: "{{ email }}"
  #           password: "{{ password }}"
  #         capture:
  #           - json: "token"
  #             as: "token"
  #     - get:
  #         url: "/v1/user"
  #         headers:
  #           Authorization: "Bearer {{ token }}"
  #     - patch:
  #         url: "/v1/users/user"
  #         headers:
  #           Authorization: "Bearer {{ token }}"
  #         json:
  #           username: "{{ username }}_updated"
  #     - get:
  #         url: "/v1/users/logout"
  #         headers:
  #           Authorization: "Bearer {{ token }}"
  # - name: "Admin Get All Users"
  #   flow:
  #     - post:
  #         url: "/v1/admin/register"
  #         json:
  #           username: "admin{{ $randomInt(
  #           email: "admin+{{ $randomInt(1, 100000) }}@example.com"
  #           password: "password123"
  #           confirmPassword: "password123"
  #     - post:
  #         url: "/v1/users/login"
  #         json:
  #           value: "admin+{{ $lastRandomInt }}@example.com"
  #           password: "password123"
  #         capture:
  #           - json: "token"
  #             as: "adminToken"
  #     - get:
  #         url: "/v1/users"
  #         headers:
  #           Authorization: "Bearer {{ adminToken }}"
  #     - get:
  #         url: "/v1/users/stats"
  #         headers:
  #           Authorization: "Bearer {{ adminToken }}"